In [8]:
import pandas as pd
import numpy as np

## Tratamento de dados nulos

### Dados numéricos

In [2]:
dataset = pd.read_csv('../0_datasets/credit_data.csv')
dataset.head()

   i#clientid        income        age         loan  c#default
0           1  66155.925095  59.017015  8106.532131          0
1           2  34415.153966  48.117153  6564.745018          0
2           3  57317.170063  63.108049  8020.953296          0
3           4  42709.534201  45.751972  6103.642260          0
4           5  66952.688845  18.584336  8770.099235          1

In [4]:
dataset.isnull().sum()

i#clientid    0
income        0
age           3
loan          0
c#default     0
dtype: int64

In [5]:
nulos = dataset[dataset.isnull().any(axis=1)]
nulos

    i#clientid        income  age         loan  c#default
28          29  59417.805406  NaN  2082.625938          0
30          31  48528.852796  NaN  6155.784670          0
31          32  23526.302555  NaN  2862.010139          0

In [7]:
dataset['age'].mean(), dataset['age'].median()

(40.80755937840458, 41.3171591130085)

In [9]:
dataset['age'] = dataset['age'].replace(to_replace=np.nan, value=dataset['age'].mean())

In [10]:
dataset.isnull().sum()

i#clientid    0
income        0
age           0
loan          0
c#default     0
dtype: int64

### Dados categóricos

In [16]:
dataset2 = pd.read_csv('../0_datasets/autos_exemple.csv', encoding='ISO-8859-1')
dataset2.head()

,dateCrawled,name,seller,offerType,price,abtest,vehicleType,yearOfRegistration,gearbox,powerPS,model,kilometer,monthOfRegistration,fuelType,brand,notRepairedDamage,dateCreated,nrOfPictures,postalCode,lastSeen
0,2016-03-24 11:52:17,Golf_3_1.6,privat,Angebot,480,test,NaN,1993,manuell,0,golf,150000,0,benzin,volkswagen,NaN,2016-03-24 00:00:00,0,70435,2016-04-07 03:16:57
1,2016-03-24 10:58:45,A5_Sportback_2.7_Tdi,privat,Angebot,18300,test,coupe,2011,manuell,190,NaN,125000,5,diesel,audi,ja,2016-03-24 00:00:00,0,66954,2016-04-07 01:46:50
2,2016-03-14 12:52:21,"Jeep_Grand_Cherokee_""Overland""",privat,Angebot,9800,test,suv,2004,automatik,163,grand,125000,8,diesel,jeep,NaN,2016-03-14 00:00:00,0,90480,2016-04-05 12:47:46
3,2016-03-17 16:54:04,GOLF_4_1_4__3TÜRER,privat,Angebot,1500,test,kleinwagen,2001,manuell,75,golf,150000,6,benzin,volkswagen,nein,2016-03-17 00:00:00,0,91074,2016-03-17 17:40:17
4,2016-03-31 17:25:20,Skoda_Fabia_1.4_TDI_PD_Classic,privat,Angebot,3600,test,kleinwagen,2008,manuell,69,fabia,90000,7,diesel,skoda,nein,2016-03-31 00:00:00,0,60437,2016-04-06 10:17:21

In [17]:
dataset2.isnull().sum()

dateCrawled                0
name                       0
seller                     0
offerType                  0
price                      0
abtest                     0
vehicleType             6010
yearOfRegistration         0
gearbox                 3214
powerPS                    0
model                   3250
kilometer                  0
monthOfRegistration        0
fuelType                5383
brand                      0
notRepairedDamage      11416
dateCreated                0
nrOfPictures               0
postalCode                 0
lastSeen                   0
dtype: int64

In [19]:
dataset2['fuelType'].unique()

array(['benzin', 'diesel', nan, 'lpg', 'andere', 'hybrid', 'cng',
       'elektro'], dtype=object)

In [24]:
from scipy import stats
import statistics

In [23]:
stats.mode(dataset2['fuelType'])

ModeResult(mode=array(['benzin'], dtype=object), count=array([35193]))

In [25]:
statistics.mode(dataset2['fuelType'])

'benzin'

In [26]:
dataset2['fuelType'] = dataset2['fuelType'].replace(to_replace=np.nan, value=statistics.mode(dataset2['fuelType']))

In [27]:
dataset2.isnull().sum()

dateCrawled                0
name                       0
seller                     0
offerType                  0
price                      0
abtest                     0
vehicleType             6010
yearOfRegistration         0
gearbox                 3214
powerPS                    0
model                   3250
kilometer                  0
monthOfRegistration        0
fuelType                   0
brand                      0
notRepairedDamage      11416
dateCreated                0
nrOfPictures               0
postalCode                 0
lastSeen                   0
dtype: int64